Davec6505/Pic32mzCNC_V3/srcs/gcode/gcode_parser.c
/* -------------------------------------------------------------------------- */
/* Flow Control Helpers - Centralized OK Management                           */
/* -------------------------------------------------------------------------- */

/**
 * @brief Check if we should send a deferred "ok" response
 *
 * Two-phase release strategy:
 *
 * Phase A — gcode queue still has commands (q->count > 0):
 *   Release ONE deferred ok each time the gcode queue count DECREASES (a
 *   command was consumed and dispatched to the trajectory planner).
 *   prev_count ensures exactly one ok per consumed slot regardless of how
 *   many times this function is called per iteration.
 *
 * Phase B — gcode queue fully drained (q->count == 0):
 *   Hold ALL remaining deferred oks until physical motion is completely done:
 *     - trajectory queue empty  (motionQueueCount == 0)
 *     - arc generation finished (arcGenState == ARC_GEN_IDLE)
 *   Then flush every remaining pending ok in one burst.
 *
 * This guarantees UGS cannot receive its final ok(s) while stepper motion
 * is still executing, regardless of how many trajectory segments an arc or
 * a dense section of linear moves generates.
 */
void GCODE_CheckDeferredOk(APP_DATA* appData, GCODE_CommandQueue* q) {
    if (appData == NULL || q == NULL) return;

    // Do NOT release deferred oks while a G4 dwell is in progress.
    if (MOTION_IsDwellActive()) {
        DEBUG_PRINT_GCODE("[FLOW] Dwell active — suppressing deferred ok release\r\n");
        return;
    }

    // Homing sentinel ($H): hold the $H ok until the homing cycle fully completes.
    // HOMING_IsActive() returns false for IDLE, COMPLETE (transient), and ALARM.
    // Also hold while state == COMPLETE because the fall-through in HOMING_Tasks()
    // resolves COMPLETE→IDLE atomically, but CheckDeferredOk can be called from the
    // motionSegmentCompleted path which runs BEFORE HOMING_Tasks() in app.c.
    // Also hold while INTERPOLATOR is still running — this guards the case where
    // CheckDeferredOk is invoked (through the motionSegmentCompleted path) before
    // HOMING_Tasks() has had a chance to see motionQueueCount == 0 and advance the
    // homing state machine.
    if (s_homing_pending) {
        if (HOMING_IsActive()) { s_homing_started = true; return; }  // mark started, keep holding
        if (!s_homing_started) return;  // $H queued but HOMING_Start() not yet called — hold
        if (HOMING_GetState() == HOMING_STATE_COMPLETE) return;  // transitioning — hold
        if (INTERPOLATOR_IsActive()) return;  // motion still running — hold
        s_homing_pending = false;
        s_homing_started = false;
        if (HOMING_GetState() == HOMING_STATE_ALARM) {
            // Failure: discard the deferred $H ok slot, send the actual alarm code.
            if (okPendingCount > 0) okPendingCount--;
            UART_Printf("ALARM:%u\r\n", (unsigned)HOMING_GetAlarmCode());
            return;
        }
        // Success: fall through to release the one pending ok normally.
        DEBUG_PRINT_GCODE("[FLOW] Homing complete — releasing $H ok\r\n");
    }

    if (okPendingCount == 0) return;

    // Drain one deferred ok per call, gated on UART3 RX ring free space.
    // Sending "ok" invites UGS to transmit the next command — only do so when
    // the ring can absorb at least one worst-case command line.
    if (UART3_ReadFreeBufferCountGet() >= UART_RX_CMD_MAX_BYTES) {
        if (UART_SendOK()) {
            okPendingCount--;
            DEBUG_PRINT_GCODE("[DEFERRED] ok drained (remaining=%lu)\r\n",
                              (unsigned long)okPendingCount);
        }
    }
}

/**
 * @brief Send "ok" at command-receive time.
 *
 * Ok is issued the moment a command enters the gcode queue (64 slots).
 * Natural backpressure: if all 64 slots are full, Extract_CommandLineFrom_Buffer
 * fails → no ok → UGS stops sending.  No HIGH_WATER math needed.
 *
 * Special deferred cases (accumulate okPendingCount, drained by
 * GCODE_CheckDeferredOk when their condition clears):
 *   - G4 dwell active: must wait for dwell timer to expire
 *   - Homing ($H): held until HOMING completes (sentinel in CheckDeferredOk)
 *   - M2/M30: held until motion fully drains (sentinel in CheckDeferredOk)
 *   - G38.x probe: held until probe triggers or fails (released in app.c)
 */
static void SendOrDeferOk(APP_DATA* appData, GCODE_CommandQueue* q)
{
    (void)appData;
    (void)q;

    // While a G4 dwell is active, defer — drained when dwell timer expires.
    if (MOTION_IsDwellActive()) {
        DEBUG_PRINT_GCODE("[FLOW] Dwell active — deferring ok\r\n");
        okPendingCount++;
        return;
    }

    // Ring-buffer backpressure gate.
    // UGS pipeline window = 128 bytes: each "ok" grants UGS permission to send
    // up to 128 bytes.  Gate threshold = UART_RX_CMD_MAX_BYTES (128 bytes) so
    // the ring can always absorb the full burst without overflow.
    // Ring = 1024 bytes → 8 × 128-byte bursts.  We send oks freely until the
    // ring has < 128 bytes free, then defer until space opens up again.
    if (UART3_ReadFreeBufferCountGet() >= UART_RX_CMD_MAX_BYTES) {
        if (UART_SendOK()) {
            DEBUG_PRINT_GCODE("[FLOW] ok sent (ring free=%lu)\r\n",
                              (unsigned long)UART3_ReadFreeBufferCountGet());
        } else {
            DEBUG_PRINT_GCODE("[FLOW] ok deferred (tx full, rx free=%lu)\r\n",
                              (unsigned long)UART3_ReadFreeBufferCountGet());
            okPendingCount++;
        }
    } else {
        DEBUG_PRINT_GCODE("[FLOW] ok deferred (ring full, free=%lu)\r\n",
                          (unsigned long)UART3_ReadFreeBufferCountGet());
        okPendingCount++;
    }
}

/* -------------------------------------------------------------------------- */
/* Real-time byte handler (? ! ~ 0x18 0x85)                                  */
/*                                                                             */
/* Called from GCODE_STATE_CONTROL_CHAR and from the GCODE_STATE_GCODE_COMMAND */
/* retry path so that status queries are answered even while the parser is    */
/* blocked waiting for the trajectory to accept an arc command.               */
/* -------------------------------------------------------------------------- */
static void service_realtime_byte(APP_DATA* appData, uint8_t c)
{
    switch (c) {
        case '?': {
            StepperPosition* pos = STEPPER_GetPosition();
            WorkCoordinateSystem* wcs = KINEMATICS_GetWorkCoordinates();
            float mpos[NUM_AXIS];
            float wpos[NUM_AXIS];
            for (E_AXIS axis = AXIS_X; axis < NUM_AXIS; axis++) {
                mpos[axis] = (float)pos->steps[axis] / pos->steps_per_mm[axis];
                wpos[axis] = mpos[axis] - GET_COORDINATE_AXIS(&wcs->offset, axis);
            }
            const char* state = "Idle";
            if (grblAlarm)                         { state = "Alarm"; }
            else if (g_feed_hold_pending)           { state = "Hold:1"; }
            else if (g_feed_hold_active)            { state = "Hold:0"; }
            else if (MOTION_IsJogging())            { state = "Jog"; }
            else if (appData->arcGenState == ARC_GEN_ACTIVE) { state = "Run"; }
            else if ((T4CON & _T4CON_ON_MASK) != 0) { state = "Run"; }
            else if (appData->motionQueueCount > 0) { state = "Run"; }
            float feedrate_mm_min = 0.0f;
            if (state[0] == 'R' || state[0] == 'J') {
                feedrate_mm_min = STEPPER_GetCurrentFeedrateMmMin();
                if (feedrate_mm_min < 1.0f)
                    feedrate_mm_min = (appData->modalFeedrate > 0.0f) ? appData->modalFeedrate : 0.0f;
            }
            uint32_t feed_display    = (uint32_t)(feedrate_mm_min + 0.5f);
            uint32_t spindle_display = appData->modalSpindleRPM;
            int ov_feed    = (int)(INTERPOLATOR_GetFeedOverride() * 100.0f + 0.5f);
            int ov_rapid   = (int)MOTION_GetRapidOverridePct();
            int ov_spindle = (int)SPINDLE_GetOverridePct();
            char ov_buf[24];
            snprintf(ov_buf, sizeof(ov_buf), "|Ov:%d,%d,%d", ov_feed, ov_rapid, ov_spindle);
            char bf_buf[24] = "";
            {
                const CNC_Settings *sr_s = SETTINGS_GetCurrent();
                if (sr_s->status_report_mask & 0x02u) {
                    /* GRBL v1.1 spec: Bf:plannerFree,rxBytesFree
                     * Second field = bytes UGS can still send before the
                     * RX ring buffer fills, NOT bytes already received. */
                    snprintf(bf_buf, sizeof(bf_buf), "|Bf:%lu,%lu",
                        (unsigned long)MOTION_GetTrajectoryFree(),
                        (unsigned long)UART3_ReadFreeBufferCountGet());
                }
            }
            uint32_t response_len = (uint32_t)snprintf((char*)txBuffer, sizeof(txBuffer),
                "<%s|MPos:%.3f,%.3f,%.3f,%.3f|WPos:%.3f,%.3f,%.3f,%.3f|FS:%lu,%lu%s%s%s>\r\n",
                state,
                mpos[AXIS_X], mpos[AXIS_Y], mpos[AXIS_Z], mpos[AXIS_A],
                wpos[AXIS_X], wpos[AXIS_Y], wpos[AXIS_Z], wpos[AXIS_A],
                (unsigned long)feed_display, (unsigned long)spindle_display,
                grblCheckMode ? "|Cm:1" : "", ov_buf, bf_buf);
            (void)UART_WriteStatusReport(txBuffer, response_len);
            break;
        }
        case '~':
            if (g_feed_hold_active || g_feed_hold_pending) {
                STEPPER_ResumeMotion();
                DEBUG_PRINT_GCODE("[GCODE] Feed hold released — motion resuming\r\n");
            }
            break;
        case '!':
            if (!g_feed_hold_active && !g_feed_hold_pending) {
                STEPPER_PauseMotion();
                DEBUG_PRINT_GCODE("[GCODE] Feed hold active\r\n");
            }
            break;
        case 0x85:
            MOTION_JogCancel();
            break;
        /* ── Feed rate overrides (GRBL v1.1 real-time bytes 0x90–0x94) ── */
        case 0x90: INTERPOLATOR_SetFeedOverride(1.0f); break;  /* Feed Reset 100% */
        case 0x91: INTERPOLATOR_SetFeedOverride(INTERPOLATOR_GetFeedOverride() + 0.10f); break; /* Feed +10% */
        case 0x92: INTERPOLATOR_SetFeedOverride(INTERPOLATOR_GetFeedOverride() - 0.10f); break; /* Feed -10% */
        case 0x93: INTERPOLATOR_SetFeedOverride(INTERPOLATOR_GetFeedOverride() + 0.01f); break; /* Feed +1% */
        case 0x94: INTERPOLATOR_SetFeedOverride(INTERPOLATOR_GetFeedOverride() - 0.01f); break; /* Feed -1% */
        /* ── Rapid overrides (0x95–0x97) ── */
        case 0x95: MOTION_SetRapidOverridePct(100u); break;  /* Rapid Reset 100% */
        case 0x96: MOTION_SetRapidOverridePct(50u);  break;  /* Rapid 50% */
        case 0x97: MOTION_SetRapidOverridePct(25u);  break;  /* Rapid 25% */
        /* ── Spindle overrides (0x99–0x9D) ── */
        case 0x99: SPINDLE_SetOverridePct(100u); break;  /* Spindle Reset 100% */
        case 0x9A: SPINDLE_SetOverridePct((uint8_t)(SPINDLE_GetOverridePct() + 10u)); break; /* Spindle +10% */
        case 0x9B: { int _s = (int)SPINDLE_GetOverridePct() - 10; SPINDLE_SetOverridePct((uint8_t)(_s > 0 ? _s : 0)); break; } /* Spindle -10% */
        case 0x9C: SPINDLE_SetOverridePct((uint8_t)(SPINDLE_GetOverridePct() + 1u)); break;  /* Spindle +1% */
        case 0x9D: { int _s = (int)SPINDLE_GetOverridePct() - 1;  SPINDLE_SetOverridePct((uint8_t)(_s > 0 ? _s : 0)); break; } /* Spindle -1% */
        default:
            /* XON/XOFF and any other unrecognised bytes — silently ignore */
            break;
    }
}

