Davec6505/Pic32mzCNC_V3/srcs/gcode/gcode_parser.c
/* -------------------------------------------------------------------------- */
/* Inline command-dispatch helpers (bypass the 64-slot gcode command queue)  */
/*                                                                             */
/* Architecture: parse one line → try MOTION_ProcessGcodeEvent for each      */
/* event immediately.  If any event is rejected (trajectory full / arc        */
/* active) return false so GCODE_STATE_GCODE_COMMAND keeps rxBuffer and       */
/* retries next iteration.  No ok is sent until all events are accepted.      */
/* This ties backpressure directly to the trajectory queue, not a 64-slot    */
/* intermediate buffer.  Arc-to-arc stall is eliminated because arc2 waits   */
/* in rxBuffer (not in the gcode queue), so the queue never fills up and     */
/* UGS's character-count flow control provides natural backpressure.          */
/* -------------------------------------------------------------------------- */

/* Dispatch a single already-split token to the motion bridge.
 * Returns true  = event dispatched (or is a harmless no-op).
 * Returns false = motion bridge cannot accept right now; caller should retry. */
static bool dispatch_one_token(APP_DATA* appData, const char* token, bool* io_is_probe)
{
    GCODE_Event ev;
    if (!parse_command_to_event(token, &ev)) return true; /* bad syntax — skip silently */
    if (ev.type == GCODE_EVENT_NONE)          return true; /* no-op (G20/G21 unit set, etc.) */

    /* Program-end events (M0/M2/M30): motion doesn't handle them; always "accepted". */
    if (ev.type == GCODE_EVENT_PROGRAM_END)   return true;

    /* Tag probe commands so ok is suppressed until probe completes. */
    if (ev.type == GCODE_EVENT_PROBE_TOWARD || ev.type == GCODE_EVENT_PROBE_AWAY) {
        if (io_is_probe) *io_is_probe = true;
    }

    return MOTION_ProcessGcodeEvent(appData, &ev);
}

/* Like split_and_queue_multi_modal but dispatches directly instead of queuing.
 * Returns false if any sub-token is rejected by the motion bridge. */
static bool split_and_dispatch_multi_modal_inline(APP_DATA* appData, char* token, bool* io_is_probe)
{
    size_t len = strlen(token);
    if (len < 3U) {
        return dispatch_one_token(appData, token, io_is_probe);
    }

    /* Collect positions of G/M designators within the token */
    uint8_t pos[8]; uint8_t posCount = 0;
    for (size_t i = 0; i < len && posCount < 8U; i++) {
        if (token[i] == 'G' || token[i] == 'M') pos[posCount++] = (uint8_t)i;
    }
    if (posCount <= 1U) {
        return dispatch_one_token(appData, token, io_is_probe);
    }

    /* Dispatch each modal prefix as a separate sub-token */
    char sub[GCODE_BUFFER_SIZE];
    for (uint8_t i = 0; i < posCount - 1U; i++) {
        size_t sublen = (size_t)(pos[i + 1U] - pos[i]);
        if (sublen >= GCODE_BUFFER_SIZE) sublen = GCODE_BUFFER_SIZE - 1U;
        memcpy(sub, &token[pos[i]], sublen);
        sub[sublen] = '\0';
        if (!dispatch_one_token(appData, sub, io_is_probe)) return false;
    }
    /* Last piece: from last modal designator to end of token */
    return dispatch_one_token(appData, &token[pos[posCount - 1U]], io_is_probe);
}

/* Parse and dispatch an entire G-code command line directly to the motion bridge.
 * Returns true  = all events accepted → caller sends ok and clears rxBuffer.
 * Returns false = at least one event blocked → caller retries next iteration. */
static bool dispatch_command_line(APP_DATA* appData,
                                   const uint8_t* buf, uint32_t length,
                                   bool* out_is_probe)
{
    *out_is_probe = false;
    char line_buffer[256];
    uint32_t safe_length = (length < (uint32_t)(sizeof(line_buffer) - 1U))
                         ? length : (uint32_t)(sizeof(line_buffer) - 1U);
    memcpy(line_buffer, buf, safe_length);
    line_buffer[safe_length] = '\0';

    /* Uppercase */
    for (uint32_t i = 0; i < safe_length; i++) {
        char c = line_buffer[i];
        if (c >= 'a' && c <= 'z') line_buffer[i] = (char)(c - 'a' + 'A');
    }
    /* Strip non-printable */
    uint32_t write_pos = 0;
    for (uint32_t i = 0; i < safe_length; i++) {
        char c = line_buffer[i];
        if ((c >= 32 && c <= 126) || c == '\r' || c == '\n' || c == '\t')
            line_buffer[write_pos++] = c;
    }
    line_buffer[write_pos] = '\0';

    TokenArray tokens;
    uint32_t token_count = UTILS_TokenizeGcodeLine(line_buffer, &tokens);

    for (uint32_t i = 0; i < token_count; i++) {
        if (UTILS_IsEmptyString(tokens.tokens[i]) || UTILS_IsComment(tokens.tokens[i])) continue;

        /* Detect combined-modal tokens like "G90G1X10" or "G21G90" */
        bool combined = false;
        if (tokens.tokens[i][0] == 'G' || tokens.tokens[i][0] == 'M') {
            for (char* p = tokens.tokens[i] + 1; *p; ++p) {
                if (*p == 'G' || *p == 'M') { combined = true; break; }
            }
        }

        bool accepted = combined
            ? split_and_dispatch_multi_modal_inline(appData, tokens.tokens[i], out_is_probe)
            : dispatch_one_token(appData, tokens.tokens[i], out_is_probe);

        if (!accepted) return false; /* motion blocked — caller retries */
    }
    return true; /* all events dispatched (or line was empty) */
}

/* -------------------------------------------------------------------------- */
/* Main G-code / Protocol Tasks                                               */
/* -------------------------------------------------------------------------- */
void GCODE_Tasks(APP_DATA* appData, GCODE_CommandQueue* commandQueue)
{
    static uint32_t call_counter = 0;
    call_counter++;
    
    // if ((call_counter % 10000) == 0) {
    //     DEBUG_PRINT_GCODE("[GCODE_Tasks] Called %lu times, state=%d\r\n", 
    //                      call_counter, gcodeData.state);
    // }
    
    GCODE_CommandQueue* cmdQueue = commandQueue;
    uint32_t nBytesAvailable = 0;

    // Drain one deferred "ok" per GCODE_Tasks call when ring buffer has room.
    // Safe to call every main-loop iteration: GCODE_CheckDeferredOk sends at
    // most ONE ok per call and only when UART3_ReadFreeBufferCountGet() >=
    // UART_RX_CMD_MAX_BYTES, so it cannot over-release into a full ring.
    if (okPendingCount > 0) {
        GCODE_CheckDeferredOk(appData, cmdQueue);
    }

    switch (gcodeData.state)
    {
    case GCODE_STATE_IDLE:
        // Boot startup line injection: auto-execute $N0/$N1 after settings load.
        // Each call injects one line (if any remain) when the RX buffer is empty.
        if (s_boot_inject_idx >= 0 && nBytesRead == 0 && !s_rxHasPushback) {
            const char* sl = NULL;
            while (s_boot_inject_idx < 2) {
                if (startupLines[s_boot_inject_idx][0] != '\0') {
                    sl = startupLines[s_boot_inject_idx++];
                    break;
                }
                s_boot_inject_idx++;
            }
            if (sl == NULL) {
                s_boot_inject_idx = -1;  // All done
            } else {
                size_t slen = strnlen(sl, GCODE_BUFFER_SIZE - 1u);
                memcpy(rxBuffer, sl, slen);
                rxBuffer[slen]     = '\n';
                nBytesRead         = (uint32_t)(slen + 1u);
                rxBuffer[nBytesRead] = '\0';
            }
        }
        // Inject any pushed-back byte first (from the GCODE_COMMAND drain loop).
        if (s_rxHasPushback && nBytesRead < sizeof(rxBuffer) - 1U) {
            rxBuffer[nBytesRead++] = s_rxPushback;
            rxBuffer[nBytesRead]   = '\0';
            s_rxHasPushback = false;
        }
        nBytesAvailable = UART3_ReadCountGet();
        if (nBytesAvailable > 0) {
            uint32_t space = (uint32_t)(sizeof(rxBuffer) - 1U - nBytesRead);
            if (space > 0U) {
                uint32_t toRead = (nBytesAvailable < space) ? nBytesAvailable : space;
                uint32_t got = UART3_Read(&rxBuffer[nBytesRead], toRead);
                nBytesRead += got;
                rxBuffer[nBytesRead] = '\0';
            }
        }

        if (nBytesRead == 0) {
            break;  // No data in buffer, exit IDLE state
        }

