Davec6505/Pic32mzCNC_V3/srcs/gcode/gcode_parser.c
            // Report G28 / G30 stored machine positions (GRBL v1.1 $# format)
            {
                float g28[4], g30[4];
                SETTINGS_GetG28Position(g28);
                SETTINGS_GetG30Position(g30);
                p += snprintf(&buf[p], sizeof(buf) - (size_t)p,
                    "[G28:%.3f,%.3f,%.3f,%.3f]\r\n[G30:%.3f,%.3f,%.3f,%.3f]\r\n",
                    (double)g28[0], (double)g28[1], (double)g28[2], (double)g28[3],
                    (double)g30[0], (double)g30[1], (double)g30[2], (double)g30[3]);
            }

            // Report all work coordinate systems (G54-G59)
            for (uint8_t wcs = 0; wcs < 6; wcs++) {
                float x, y, z;
                if (SETTINGS_GetWorkCoordinateSystem(wcs, &x, &y, &z)) {
                    p += snprintf(&buf[p], sizeof(buf)-p, "[G%d:%.3f,%.3f,%.3f]\r\n", 
                                 54 + wcs, x, y, z);
                }
            }
            
            // Report G92 coordinate offset (live value from kinematics, not flash)
            float g92_x, g92_y, g92_z;
            KINEMATICS_GetG92Offset(&g92_x, &g92_y, &g92_z);
            p += snprintf(&buf[p], sizeof(buf)-p, "[G92:%.3f,%.3f,%.3f]\r\n", g92_x, g92_y, g92_z);
            
            // Report live tool length offset (reflects G43, G43.1 and G49)
            bool tlo_active = false;
            float tlo = KINEMATICS_GetTLO(&tlo_active);
            (void)tlo_active;  // active flag available for future use
            p += snprintf(&buf[p], sizeof(buf)-p, "[TLO:%.3f]\r\n", tlo);
            
            // Report last probe result (contact position + triggered flag)
            p += snprintf(&buf[p], sizeof(buf)-p, "[PRB:%.3f,%.3f,%.3f:%d]\r\n",
                (double)appData->probePosition.coordinate[AXIS_X],
                (double)appData->probePosition.coordinate[AXIS_Y],
                (double)appData->probePosition.coordinate[AXIS_Z],
                appData->probeSuccess ? 1 : 0);
            
            UART3_Write((uint8_t*)buf, (uint32_t)p);
            handled = true;
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == 'G') {
            char state_buffer[160];
            int l = 0;
            l += sprintf(&state_buffer[l], "[GC:");
            l += sprintf(&state_buffer[l], "G0 ");
            l += sprintf(&state_buffer[l], "G%d ", 54 + appData->activeWCS);  // Dynamic WCS (G54-G59)
            l += sprintf(&state_buffer[l], "G%d ", appData->modalPlane == 0 ? 17 : (appData->modalPlane == 1 ? 18 : 19));
            l += sprintf(&state_buffer[l], "%s ", unitsInches ? "G20" : "G21");
            l += sprintf(&state_buffer[l], "G%d ", appData->absoluteMode ? 90 : 91);
            l += sprintf(&state_buffer[l], "G94 ");
            // Tool length offset modal state (G43 if active, G49 if cancelled)
            { bool tlo_on = false; KINEMATICS_GetTLO(&tlo_on);
              l += sprintf(&state_buffer[l], "%s ", tlo_on ? "G43" : "G49"); }
            l += sprintf(&state_buffer[l], "M5 ");
            l += sprintf(&state_buffer[l], "M9 ");
            l += sprintf(&state_buffer[l], "T%lu ", (unsigned long)appData->modalToolNumber);
            // ✅ FIX: Use integer cast to avoid float/double ABI mismatch in sprintf
            l += sprintf(&state_buffer[l], "F%lu ", (unsigned long)(uint32_t)(appData->modalFeedrate + 0.5f));
            l += sprintf(&state_buffer[l], "S%lu", (unsigned long)appData->modalSpindleRPM);
            l += sprintf(&state_buffer[l], "]\r\n");
            UART3_Write((uint8_t*)state_buffer, (uint32_t)l);
            handled = true;
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == 'H') {
            // $H - Homing cycle command
            // Create homing event and add to command queue
            if (cmdQueue->count < GCODE_MAX_COMMANDS) {
                strcpy(cmdQueue->commands[cmdQueue->head].command, "$H");
                cmdQueue->head = (cmdQueue->head + 1) % GCODE_MAX_COMMANDS;
                cmdQueue->count++;
            }
            handled = true;
            // Defer the ok: send ONLY after homing succeeds (IDLE) or
            // send ALARM:9 on failure.  Do NOT send ok immediately.
            send_ok = false;
            s_homing_pending = true;
            okPendingCount++;
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == 'L') {
            // $L - Debug command: Show limit switch states
            CNC_Settings* settings = SETTINGS_GetCurrent();
            
            DEBUG_PRINT_GCODE("[LIMIT] Pins: X_Min=%d X_Max=%d Y_Min=%d Y_Max=%d Z_Min=%d Z_Max=%d A_Min=%d A_Max=%d\r\n",
                             LIMIT_GetMin(AXIS_X), LIMIT_GetMax(AXIS_X),
                             LIMIT_GetMin(AXIS_Y), LIMIT_GetMax(AXIS_Y),
                             LIMIT_GetMin(AXIS_Z), LIMIT_GetMax(AXIS_Z),
                             LIMIT_GetMin(AXIS_A), LIMIT_GetMax(AXIS_A));
            
            DEBUG_PRINT_GCODE("[LIMIT] Settings: $5=%u $21=%u (%s)\r\n", 
                             settings->limit_pins_invert,
                             settings->hard_limits_enable,
                             settings->hard_limits_enable ? "ENABLED" : "DISABLED");
            
            // Show which axes would trigger alarm
            bool any_triggered = false;
            for (E_AXIS axis = AXIS_X; axis < NUM_AXIS; axis++) {
                bool triggered = LIMIT_CheckAxis(axis, settings->limit_pins_invert);
                if (triggered) {
                    DEBUG_EXEC_GCODE({
                        char axis_name = 'X' + axis;
                        DEBUG_PRINT_GCODE("[LIMIT] *** AXIS %c TRIGGERED ***\r\n", axis_name);
                    });
                    any_triggered = true;
                }
            }
            if (!any_triggered) {
                DEBUG_PRINT_GCODE("[LIMIT] All clear - no limits triggered\r\n");
            }
            
            handled = true;
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == 'I') {
            SETTINGS_PrintBuildInfo();
            handled = true;
            send_ok = false;
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == 'U') {
            if (len == 2) {
                UART_TxStats stats;
                UART_GetTxStats(&stats);
                UART_Printf("[TX:OK_ATT=%lu,OK_ENQ=%lu,OK_DROP=%lu,LAST_OK_FREE=%lu]\r\n",
                            (unsigned long)stats.ok_attempted,
                            (unsigned long)stats.ok_enqueued,
                            (unsigned long)stats.ok_dropped,
                            (unsigned long)stats.last_ok_tx_free);
                UART_Printf("[TX:ST_ATT=%lu,ST_ENQ=%lu,ST_DROP=%lu,LAST_ST_FREE=%lu,LAST_ST_LEN=%lu]\r\n",
                            (unsigned long)stats.status_attempted,
                            (unsigned long)stats.status_enqueued,
                            (unsigned long)stats.status_dropped,
                            (unsigned long)stats.last_status_tx_free,
                            (unsigned long)stats.last_status_len);
                handled = true;
            } else if (len == 4 && cmd[2] == '=' && cmd[3] == '0') {
                UART_ResetTxStats();
                UART_Printf("[MSG:UART TX stats reset]\r\n");
                handled = true;
            } else {
                UART3_Write((uint8_t*)"error:4\r\n", 10);
                send_ok = false;
                handled = true;
            }
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == 'N') {
            char buf[160];
            int p = 0;
            p += snprintf(&buf[p], sizeof(buf)-p, "[N0:%s]\r\n", startupLines[0]);
            p += snprintf(&buf[p], sizeof(buf)-p, "[N1:%s]\r\n", startupLines[1]);
            UART3_Write((uint8_t*)buf, (uint32_t)p);
            handled = true;
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == 'C') {
            grblCheckMode = !grblCheckMode;
            handled = true;
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == 'X') {
            grblAlarm = false;
            
            // ✅ Clear hard limit alarm flag (set by stepper ISR)
            // g_hard_limit_alarm declared in stepper.h (already included at top)
            g_hard_limit_alarm = false;
            
            // ✅ CRITICAL FIX: Clear hard limit suppression flag
            // This allows recovery after moving off limit switch
            // User must physically move off limit before $X will work
            CNC_Settings* settings = SETTINGS_GetCurrent();
            if (!MOTION_UTILS_CheckHardLimits(settings->limit_pins_invert)) {
                // Limits are clear - allow recovery
                g_suppress_hard_limits = false;
                // Clear non-hard-limit alarms (ALARM:3 motion abort, ALARM:6 homing abort, etc.)
                if (appData->state == APP_ALARM && appData->alarmCode != 1) {
                    appData->state = APP_IDLE;
                    appData->alarmCode = 0;
                }
                DEBUG_PRINT_GCODE("[GCODE] Alarm cleared via $X - limits clear, recovery allowed\r\n");
            } else {
                // Still on limit - cannot clear alarm
                UART_Printf("[MSG:Cannot clear alarm - move off limit switch first]\r\n");
                g_hard_limit_alarm = true;  // Keep alarm active
                grblAlarm = true;
                send_ok = false;  // Don't send ok for failed $X
            }
            
            handled = true;
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == 'F') {
            UART3_Write((uint8_t*)"[F:100|S:100]\r\n", 15);
            handled = true;
        }
        else if (len >= 5 && cmd[0] == '$' && cmd[1] == 'R' && cmd[2] == 'S' && cmd[3] == 'T' && cmd[4] == '=') {
            char target = cmd[5];
            if (target == '*') {
                SETTINGS_RestoreDefaults(SETTINGS_GetCurrent());
                grblAlarm = false;
            } else if (target == '$') {
                SETTINGS_RestoreDefaults(SETTINGS_GetCurrent());
            } else if (target == '#') {
                // Clear active WCS in RAM
                WorkCoordinateSystem* wcs = KINEMATICS_GetWorkCoordinates();
                for (E_AXIS axis = AXIS_X; axis < NUM_AXIS; axis++) {
                    SET_COORDINATE_AXIS(&wcs->offset, axis, 0.0f);
                }
                // Clear all WCS slots (G54-G59) in flash
                for (uint8_t i = 0; i < 6u; i++) {
                    SETTINGS_SetWorkCoordinateSystem(i, 0.0f, 0.0f, 0.0f);
                }
                // Clear G92 temporary offset and persist everything
                KINEMATICS_ClearG92Offset();
                SETTINGS_SaveToFlash(SETTINGS_GetCurrent());
            } else {
                UART3_Write((uint8_t*)"error:4\r\n", 10);
                send_ok = false;
            }
            handled = true;
        }
        else if (len >= 4 && cmd[0] == '$' && cmd[1] == 'S' && cmd[2] == 'L' && cmd[3] == 'P') {
            UART3_Write((uint8_t*)"error:2\r\n", 10);
            send_ok = false;
            handled = true;
        }
        else if (cmd[0] == '$' && isdigit((unsigned char)cmd[1])) {
            char* pend;
            long param = strtol(&cmd[1], &pend, 10);
            if (param < 0) {
                UART3_Write((uint8_t*)"error:3\r\n", 10);
                send_ok = false;
                handled = true;
            } else if (*pend == '=') {
                float val = strtof(pend + 1, NULL);
                CNC_Settings* s = SETTINGS_GetCurrent();
                if (SETTINGS_SetValue(s, (uint32_t)param, val)) {
                    s->checksum = SETTINGS_CalculateCRC32(s);
                    
                    // ✅ Save to flash immediately so setting persists across resets
                    SETTINGS_SaveToFlash(s);
                    
                    // Reload stepper cached settings if step/dir/enable invert changed ($0-$5)
                    if (param <= 5) {
                        STEPPER_ReloadSettings();
                    }

#ifdef HAS_TMC5160_AXIS
                    // Re-apply TMC5160 configuration when motor driver params change ($200-$253)
                    // Parameter layout: $2X0 = axis X, $2X1 = axis Y, $2X2 = Z, $2X3 = A
                    if (param >= 200 && param <= 253) {
                        uint32_t axis_idx = (uint32_t)param % 10;
                        if (axis_idx < (uint32_t)NUM_AXIS) {
                            TMC5160_ApplySettings((E_AXIS)axis_idx, s);
                        }
                    }
#endif
                    
                    handled = true;
                } else {
                    UART3_Write((uint8_t*)"error:3\r\n", 10);
                    send_ok = false;
                    handled = true;
                }
            } else if (*pend == '\0') {
                float val = SETTINGS_GetValue(SETTINGS_GetCurrent(), (uint32_t)param);
                int out = snprintf((char*)txBuffer, sizeof(txBuffer), "$%ld=%g\r\n", param, val);
                UART3_Write(txBuffer, (uint32_t)out);
                handled = true;
            } else {
                UART3_Write((uint8_t*)"error:4\r\n", 10);
                send_ok = false;
                handled = true;
            }
        }
        else if (len >= 5 && cmd[0] == '$' && cmd[1] == 'S' && cmd[2] == 'A' && cmd[3] == 'V' && cmd[4] == 'E') {
            // $SAVE - Explicitly save current settings to flash
            CNC_Settings* settings = SETTINGS_GetCurrent();
            if (settings != NULL && SETTINGS_SaveToFlash(settings)) {
                UART3_Write((uint8_t*)"[MSG:Settings saved to flash]\r\n", 33);
            } else {
                UART3_Write((uint8_t*)"error:9\r\n", 10);  // Error 9: Flash write failed
                send_ok = false;
            }
            handled = true;
        }
        else if (len == 1 && cmd[0] == '$') {
            UART3_Write((uint8_t*)"[HLP:$$ $# $G $I $N $C $X $F $RST= $SAVE $SLP $L]\r\n", 53);
            UART3_Write((uint8_t*)"[MSG:$21 Hard Limits Enable - $21=0 (disabled), $21=1 (enabled)]\r\n", 68);
            UART3_Write((uint8_t*)"[MSG:$5 Limit Pin Invert - NO switch:$5=0 (pin HIGH triggers), NC switch:$5=255 (pin LOW triggers)]\r\n", 103);
            UART3_Write((uint8_t*)"[MSG:$L - Show limit switch states (debug)]\r\n", 46);
            handled = true;
        }
        else if (len >= 3 && cmd[0] == '$' && cmd[1] == 'J' && cmd[2] == '=') {
            // $J= jog command — parsed and submitted directly (bypasses command queue).
            // GRBL v1.1: sends "ok" on acceptance; error on alarm, bad syntax, or queue full.
            if (grblAlarm) {
                UART3_Write((uint8_t*)"error:2\r\n", 9);
                send_ok = false;
            } else {
                const char *p = &cmd[3];
                bool jog_relative = !appData->absoluteMode;
                bool jog_inches   = unitsInches;
                float jx = NAN, jy = NAN, jz = NAN, ja = NAN, jf = NAN;
                bool parse_err = false;

                while (*p && !parse_err) {
                    char ch = (char)toupper((unsigned char)*p);
                    if (ch == ' ' || ch == '\t') { p++; continue; }
                    if (ch == 'G') {
                        p++;
                        char *end = NULL;
                        long gnum = strtol(p, &end, 10);
                        if (end == p) { parse_err = true; break; }
                        p = end;
                        if      (gnum == 90) jog_relative = false;
                        else if (gnum == 91) jog_relative = true;
                        else if (gnum == 20) jog_inches   = true;
                        else if (gnum == 21) jog_inches   = false;
                        else { parse_err = true; }
                    } else if (ch == 'X' || ch == 'Y' || ch == 'Z' || ch == 'A' || ch == 'F') {
                        p++;
                        char *end = NULL;
                        float val = strtof(p, &end);
                        if (end == p) { parse_err = true; break; }
                        p = end;
                        if      (ch == 'X') jx = val;
                        else if (ch == 'Y') jy = val;
                        else if (ch == 'Z') jz = val;
                        else if (ch == 'A') ja = val;
                        else if (ch == 'F') jf = val;
                    } else {
                        parse_err = true;
                    }
                }

                // F word is mandatory; at least one axis must be specified
                if (parse_err || isnan(jf) || jf <= 0.0f ||
                    (isnan(jx) && isnan(jy) && isnan(jz) && isnan(ja))) {
                    UART3_Write((uint8_t*)"error:4\r\n", 9);
                    send_ok = false;
                } else {
                    float scale = jog_inches ? 25.4f : 1.0f;

                    // Resolve target in work coords (default unspecified axes to current work pos)
                    CoordinatePoint cur_m = KINEMATICS_GetCurrentPosition();
                    CoordinatePoint cur_w = KINEMATICS_MachineToWork(cur_m);
                    CoordinatePoint tgt_w = cur_w;

                    if (!isnan(jx)) {
                        if (jog_relative) tgt_w.coordinate[AXIS_X] += jx * scale;
                        else              tgt_w.coordinate[AXIS_X]  = jx * scale;
                    }
                    if (!isnan(jy)) {
                        if (jog_relative) tgt_w.coordinate[AXIS_Y] += jy * scale;
                        else              tgt_w.coordinate[AXIS_Y]  = jy * scale;
                    }
                    if (!isnan(jz)) {
                        if (jog_relative) tgt_w.coordinate[AXIS_Z] += jz * scale;
                        else              tgt_w.coordinate[AXIS_Z]  = jz * scale;
                    }
                    if (!isnan(ja)) {
                        if (jog_relative) tgt_w.coordinate[AXIS_A] += ja * scale;
                        else              tgt_w.coordinate[AXIS_A]  = ja * scale;
                    }

                    jf *= scale;  // scale feedrate if in inches mode

                    // Cap feedrate to the most restrictive axis max_rate
                    const CNC_Settings *js = SETTINGS_GetCurrent();
                    float fr_cap = js->max_rate[AXIS_X];
                    for (E_AXIS ax = AXIS_Y; ax < NUM_AXIS; ax++) {
                        if (js->max_rate[ax] < fr_cap) fr_cap = js->max_rate[ax];
                    }
                    if (jf > fr_cap) jf = fr_cap;
                    if (jf < 1.0f)   jf = 1.0f;

