Davec6505/Pic32mzCNC_V3/srcs/gcode/gcode_parser.c
                    // Build jog event and submit directly to motion bridge
                    GCODE_Event ev;
                    memset(&ev, 0, sizeof(ev));
                    ev.type                     = GCODE_EVENT_JOG;
                    ev.data.linearMove.x        = tgt_w.coordinate[AXIS_X];
                    ev.data.linearMove.y        = tgt_w.coordinate[AXIS_Y];
                    ev.data.linearMove.z        = tgt_w.coordinate[AXIS_Z];
                    ev.data.linearMove.a        = tgt_w.coordinate[AXIS_A];
                    ev.data.linearMove.feedrate = jf;
                    ev.data.linearMove.isRapid  = false;
                    ev.data.linearMove.is_jog   = true;

                    if (!MOTION_ProcessGcodeEvent(appData, &ev)) {
                        // Trajectory queue full
                        UART3_Write((uint8_t*)"error:8\r\n", 9);
                        send_ok = false;
                    }
                    // send_ok remains true on successful submission
                }
            }
            handled = true;
        }

        if (handled && send_ok) {
            if (!UART_SendOK()) {
                okPendingCount++;
                DEBUG_PRINT_GCODE("[QUERY] ok deferred (tx full)\r\n");
            }
        } else if (!handled) {
            UART3_Write((uint8_t*)"error:4\r\n", 10);
        }

        {
            uint32_t skip_pos = (uint32_t)len + 1u;
            while (skip_pos < nBytesRead && (rxBuffer[skip_pos] == '\r' || rxBuffer[skip_pos] == '\n'))
                skip_pos++;
            uint32_t remaining_bytes = nBytesRead - skip_pos;
            if (remaining_bytes > 0) {
                memmove(rxBuffer, &rxBuffer[skip_pos], remaining_bytes);
                nBytesRead = remaining_bytes;
                rxBuffer[nBytesRead] = '\0';
            } else {
                nBytesRead = 0;
                memset(rxBuffer, 0, sizeof(rxBuffer));
            }
        }
        gcodeData.state = GCODE_STATE_IDLE;
        break;
    }

    case GCODE_STATE_GCODE_COMMAND:
    {
        uint32_t cmd_end = 0;
        for (uint32_t i = 0; i < nBytesRead; i++) {
            if (rxBuffer[i] == '\0') { cmd_end = i; break; }
        }
        // Inline dispatch: parse every event in this line and try to send each
        // directly to the motion bridge (trajectory).  If the bridge rejects any
        // event (arc active, trajectory full, or motion drain pending) we stay in
        // this state and retry next iteration — rxBuffer is preserved, no ok sent.
        // Back-pressure: UGS gets no ok → stops sending → UART ring fills slowly.
        // This eliminates the arc-to-arc stall: arc2 waits here (1 slot) instead
        // of piling up behind 64 gcode-queue entries while ok credits are already
        // exhausted.
        bool is_probe_cmd = false;
        if (!dispatch_command_line(appData, rxBuffer, cmd_end, &is_probe_cmd)) {
            // Drain real-time control bytes (primarily '?') from the ring ONLY on the
            // first retry iteration (when the pushback slot is empty).  In pipelined
            // mode UGS has already sent the next G-code commands into the ring; each
            // retry consumes one more ring byte and overwrites the pushback slot,
            // destroying the queued G-code data byte-by-byte.  Stopping once the slot
            // is filled guarantees ring integrity from that point on.
            //
            // In single-step mode the ring only contains '?' bytes so this path
            // services them correctly on every retry iteration (the pushback never
            // gets set because no G-code bytes arrive until the ok is sent).
            //
            // '?' bytes that arrive after the pushback is set stay in the ring behind
            // the G-code bytes.  They are processed correctly by GCODE_STATE_IDLE
            // once the arc finishes and arc2 is dispatched.
            if (!s_rxHasPushback) {
                uint8_t rt;
                while (UART3_ReadCountGet() > 0) {
                    if (UART3_Read(&rt, 1) != 1) break;
                    if (rt == 0x18) { GCODE_SoftReset(appData, cmdQueue); return; }
                    if (!is_control_char(rt)) {
                        // First byte of a G-code command — push it back and stop.
                        // All subsequent ring bytes (rest of that command + further
                        // commands) remain intact for GCODE_STATE_IDLE to pick up.
                        s_rxPushback    = rt;
                        s_rxHasPushback = true;
                        break;
                    }
                    service_realtime_byte(appData, rt);
                }
            }
            /* Rate-limited unsolicited status: keep UGS visualisation alive when
             * '?' bytes cannot be reached through buffered G-code in the ring.
             * CP0 Count increments at CPU_FREQ/2 = 100 MHz; 20 000 000 ticks ≈ 200 ms.
             * Uses unsigned subtraction so wrap-around (every ~42.9 s) is handled. */
            {
                static uint32_t s_last_retry_status = 0;
                uint32_t now = (uint32_t)_CP0_GET_COUNT();
                if ((now - s_last_retry_status) >= 20000000UL) {
                    service_realtime_byte(appData, '?');
                    s_last_retry_status = now;
                }
            }
            break;  // stay in GCODE_STATE_GCODE_COMMAND, retry next iteration
        }

        // All events dispatched — send ok (probe commands own their ok via app.c)
        if (!is_probe_cmd) {
            DEBUG_PRINT_GCODE("[CMD_OK] dispatched '%s' arcState=%d ringFree=%lu okPend=%lu\r\n",
                rxBuffer, (int)appData->arcGenState,
                (unsigned long)UART3_ReadFreeBufferCountGet(),
                (unsigned long)okPendingCount);
            SendOrDeferOk(appData, cmdQueue);
        } else {
            DEBUG_PRINT_GCODE("[GCODE_CMD] Probe command — ok withheld until completion\r\n");
        }

        {
            uint32_t skip_pos = cmd_end + 1u;
            /* Only consume the LF of a \r\n pair — any further \n are blank lines
             * that must stay in rxBuffer for IDLE to process and send ok for. */
            if (s_last_cmd_terminator == '\r' && skip_pos < nBytesRead && rxBuffer[skip_pos] == '\n') {
                skip_pos++;
            }
            uint32_t remaining_bytes = nBytesRead - skip_pos;
            if (remaining_bytes > 0) {
                memmove(rxBuffer, &rxBuffer[skip_pos], remaining_bytes);
                nBytesRead = remaining_bytes;
                rxBuffer[nBytesRead] = '\0';
            } else {
                nBytesRead = 0;
                memset(rxBuffer, 0, sizeof(rxBuffer));
            }
        }
        gcodeData.state = GCODE_STATE_IDLE;
        break;
    }

    case GCODE_STATE_ERROR:
    {
        uint32_t error_len = (uint32_t)sprintf((char*)txBuffer, "error:1\r\n");
        UART3_Write(txBuffer, error_len);
        {
            uint32_t err_cmd_len = (uint32_t)strlen((char*)rxBuffer);
            uint32_t skip_pos = err_cmd_len + 1u;
            while (skip_pos < nBytesRead && (rxBuffer[skip_pos] == '\r' || rxBuffer[skip_pos] == '\n'))
                skip_pos++;
            uint32_t remaining_bytes = nBytesRead - skip_pos;
            if (remaining_bytes > 0) {
                memmove(rxBuffer, &rxBuffer[skip_pos], remaining_bytes);
                nBytesRead = remaining_bytes;
                rxBuffer[nBytesRead] = '\0';
            } else {
                nBytesRead = 0;
                memset(rxBuffer, 0, sizeof(rxBuffer));
            }
        }
        gcodeData.state = GCODE_STATE_IDLE;
        break;
    }

    default:
        break;
    }
}

/* Optional future advanced parsing disabled */
#if 0
#endif


